

class Test_level_03:
    lvl_name: str = "test_01"
    col_x: int = 10
    col_y: int = 10
    cells: tuple = (2, 2, 1, 1, 2, 2, 1, 1, 2, 2,) * 10
    walls: tuple = [[i, 1, 1, (3, 4), False, False] for i in range(0, 10)]  # 4 - можно смотреть сквозь, 5 -
    # можно атаковать сквозь
    to_nest_level: tuple = None
    grid = [[0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 2, 0, 0, 0, 0, 0, 0, 0, 0]]
    k = 0